# импорт библиотек
from tkinter import *

# ************************************************************
# Отсюда будем писать методы и функции
# ************************************************************


def someFun()


# создаем переменную (нашего окна), и передаем ей управление библиотекой:
root = Tk()

# ************************************************************
# Отсюда определим значения переменных
# ************************************************************

# ************************************************************
# Отсюда организуем формирование элементов в окне
# ************************************************************

# Создаём главное окно


# Выводим главное окно на экран:
root.mainloop()